src/projects/configuration/251029_GKSTCPLK-1831/src/DataProcessors/гкс_АРМПромежуточныйКомпозит.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>гкс_АРМПромежуточныйКомпозит</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокСостояний</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебнаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Силос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныеСуткиРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлассификаторСтанцийЖД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРегистраций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументРегистрации</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/projects/configuration/251029_GKSTCPLK-1831/src/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/projects/configuration/251029_GKSTCPLK-1831/src/DataProcessors/гкс_АРМПромежуточныйКомпозит/Forms/ФормаФормированиеКомпозитнойФормы/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтраницаУсиленныйКонтроль = Параметры.Свойство("СтраницаУсиленныйКонтроль");
	СтраницаПроизвольныйКомпозит = Параметры.Свойство("СтраницаПроизвольныйКомпозит");
	
	Если СтраницаУсиленныйКонтроль Или СтраницаПроизвольныйКомпозит Тогда
		
		ДопПараметры = Параметры.ДопПараметры;
		МассивСтрокДанных = ДопПараметры.МассивСтрокДанных;
		// Таблица регистраций уже заполнена из отмеченных строк в предыдущей форме
		Если Не ДопПараметры.Свойство("МассивСтрокДанных") ИЛИ МассивСтрокДанных.Количество() = 0 Тогда
			Отказ = Истина;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Объект, ДопПараметры);
		
		// Заполняем таблицу регистраций из отмеченных строк
		Объект.ТаблицаРегистраций.Очистить();
		Для Каждого СтруктураСтроки Из МассивСтрокДанных Цикл
			НоваяСтрока = Объект.ТаблицаРегистраций.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураСтроки);
		КонецЦикла;
		
		// Заполняем реквизиты объекта из первого элемента отмеченных строк
		ПервыйЭлемент = ДопПараметры.МассивСтрокДанных[0];
		ЗаполнитьЗначенияСвойств(Объект, ПервыйЭлемент);
		
		Если СтраницаПроизвольныйКомпозит Тогда
			ЗаполнитьПоказателиИзНормативнойСертификацииНаСервере(ДопПараметры);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимостьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоказатели

&НаКлиенте
Процедура ПоказателиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Показатели.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные.Показатель) Тогда
		Возврат;
	КонецЕсли;
	
	НайденыйПоказатели = Объект.Показатели.НайтиСтроки(Новый Структура("Показатель", ТекущиеДанные.Показатель));
	Если НайденыйПоказатели.Количество() > 1 Тогда
		Индекс = Объект.Показатели.Индекс(ТекущиеДанные);
		Если Индекс <> Неопределено Тогда
			Объект.Показатели.Удалить(Индекс);
		КонецЕсли;
		
	Иначе
		ВыполнитьПроверкуНормативовПоказателя(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСформироватьПромежуточныйКомпозит(Команда)
	
	СформироватьДокумент();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоказательПоСпецификации(Команда)
	
	Если НормативныеПоказатели.Количество() = 0 Тогда
		ПоказатьПредупреждение( , "Нет доступных показателей из нормативной сертификации для данной номенклатуры.");
		Возврат;
	КонецЕсли;
	
	// Получаем список уже добавленных показателей
	УжеДобавленныеПоказатели = ПолучитьДобавленныеПоказатели();
	
	// Формируем список доступных для выбора (нормативные МИНУС уже добавленные)
	ДоступныеДляВыбора = Новый Массив;
	Для Каждого НормативныйПоказатель Из НормативныеПоказатели Цикл
		Если УжеДобавленныеПоказатели.Найти(НормативныйПоказатель.Значение) = Неопределено Тогда
			ДоступныеДляВыбора.Добавить(НормативныйПоказатель.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если ДоступныеДляВыбора.Количество() = 0 Тогда
		ПоказатьПредупреждение( , "Все нормативные показатели уже добавлены в таблицу.");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = ПолучитьПараметрыФормыДляНормативныхПоказателей(ДоступныеДляВыбора);
	
	// Открываем форму выбора показателей анализа
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПоказателей", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.гкс_ПоказателиАнализовНоменклатуры.ФормаВыбора",
		ПараметрыФормы,
		ЭтотОбъект,
		УникальныйИдентификатор,
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#Область ВидимостьДоступность
&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементовФормы()
	Элементы.ГруппаПоказатели.Видимость = СтраницаПроизвольныйКомпозит;	
КонецПроцедуры
#КонецОбласти

&НаСервере
Функция ПроверитьПараметры()
	Возврат Не ЗначениеЗаполнено(Объект.Номенклатура)
		Или Не ЗначениеЗаполнено(Объект.ТочкаМаршрута)
		Или Не ЗначениеЗаполнено(Объект.ВидПеревозки);
КонецФункции

&НаСервере
Процедура СформироватьДокумент()
	
	
	Если Объект.ТаблицаРегистраций.Количество() > 0 Тогда
		
		Попытка
			
			// Подготовка данных заполнения для лабораторного анализа
			ПараметрыСозданияАнализа = Новый Структура;
			ПараметрыСозданияАнализа.Вставить("гкс_НазначениеИспользованияКачества",
				Перечисления.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит);
			
			// Подготовка данных заполнения для лабораторного анализа
			ИмяПараметраПоказатели = "ПоказателиДляЗаполнения";
			МассивПоказателей = Неопределено;

			МассивПоказателей = Новый Массив;
			Для Каждого СтрокаПоказатель Из Объект.Показатели Цикл
				Если Не ЗначениеЗаполнено(СтрокаПоказатель.Показатель) Тогда
					Продолжить;
				КонецЕсли;

				СтруктураПоказателя = Новый Структура;
				СтруктураПоказателя.Вставить("Показатель", СтрокаПоказатель.Показатель);
				СтруктураПоказателя.Вставить("ЕдиницаИзмерения", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
					СтрокаПоказатель.Показатель, "ЕдиницаИзмерения"));
				МассивПоказателей.Добавить(СтруктураПоказателя);
			КонецЦикла;

			
			Если ЗначениеЗаполнено(МассивПоказателей) И МассивПоказателей.Количество() > 0 Тогда 
				ПараметрыСозданияАнализа.Вставить(ИмяПараметраПоказатели, МассивПоказателей);
			Иначе 
				ПараметрыСозданияАнализа.Вставить(ИмяПараметраПоказатели, Неопределено);	
			КонецЕсли;

			
			ПараметрыСоздания = Новый Структура;
			ПараметрыСоздания.Вставить("ТочкаМаршрута", Объект.ТочкаМаршрута);
			ПараметрыСоздания.Вставить("ПроизводственныеСуткиРегистрации", Объект.ПроизводственныеСуткиРегистрации);
			ПараметрыСоздания.Вставить("ТаблицаРегистраций", Объект.ТаблицаРегистраций.Выгрузить());

			Документы.гкс_ФормированиеНомераПробы.ДокументПромежуточногоКомпозита(ПараметрыСоздания, 
				ПараметрыСозданияАнализа);
			
		Исключение

			ТекстОшибки = "Ошибка при создании документов: " + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			
			Возврат;
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполнение показателей из документа НормативнаяСертификацияНоменклатуры
// для назначения использования "Промежуточный композит"
//
&НаСервере
Процедура ЗаполнитьПоказателиИзНормативнойСертификацииНаСервере(ДопПараметры)
	
	Если ПроверитьПараметры() Тогда
		Возврат;
	КонецЕсли;
	
	ДобавленныеПоказатели = Новый Массив;
	
	НазначениеИспользования = Перечисления.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит;
	
	// Запрос для получения показателей из нормативной сертификации
	Запрос = Новый Запрос;
	Запрос.Текст = гкс_РаботаСПоказателямиНоменклатуры.УстановитьТекстЗапросаОбъединенногоПолученияПоказателей();
	
	
	Запрос.УстановитьПараметр("Номенклатура", Объект.Номенклатура);
	Запрос.УстановитьПараметр("НазначениеИспользованияКачества", НазначениеИспользования);
	Запрос.УстановитьПараметр("ТочкаМаршрута", Объект.ТочкаМаршрута);
	Запрос.УстановитьПараметр("ВидПеревозки", Объект.ВидПеревозки);
	Запрос.УстановитьПараметр("ДатаНачала", ДопПараметры.НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", ДопПараметры.КонецПериода);
	Запрос.УстановитьПараметр("ДокументРегистрации", Документы.гкс_СРПВПеревеска.ПустаяСсылка());
	Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.УстановитьПараметр("УсиленныйКонтроль", Ложь);
	
	ТекстУсловияПоказательАнализа = "ИСТИНА";
	ТекстУсловияПоказательУсиленногоКонтроля = "ИСТИНА";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстУсловияПоказательАнализа", ТекстУсловияПоказательАнализа);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстУсловияПоказательУсиленногоКонтроля",
			ТекстУсловияПоказательУсиленногоКонтроля);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если ДобавленныеПоказатели.Найти(Выборка.Показатель) = Неопределено Тогда
				ДобавленныеПоказатели.Добавить(Выборка.Показатель);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	НормативныеПоказатели.ЗагрузитьЗначения(ДобавленныеПоказатели);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПоказателей(ВыбранныеЗначения, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеЗначения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранныеЗначения) = Тип("Массив") Тогда
		Для Каждого ВыбранныйПоказатель Из ВыбранныеЗначения Цикл
			ДобавитьПоказательВТаблицу(ВыбранныйПоказатель);
		КонецЦикла;
	Иначе
		ДобавитьПоказательВТаблицу(ВыбранныеЗначения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДобавленныеПоказатели()
	ДобавленныеПоказатели = Новый Массив;
	
	Для Каждого СтрокаПоказателя Из Объект.Показатели Цикл
		Если ЗначениеЗаполнено(СтрокаПоказателя.Показатель) Тогда
			ДобавленныеПоказатели.Добавить(СтрокаПоказателя.Показатель);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДобавленныеПоказатели;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьПоказательВТаблицу(Показатель)
	
	Для Каждого СтрокаПоказателя Из Объект.Показатели Цикл
		Если СтрокаПоказателя.Показатель = Показатель Тогда
			Возврат; // Показатель уже есть
		КонецЕсли;
	КонецЦикла;
	
	НоваяСтрока = Объект.Показатели.Добавить();
	НоваяСтрока.Показатель = Показатель;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыФормыДляНормативныхПоказателей(ДоступныеПоказатели)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	
	Если ДоступныеПоказатели.Количество() > 0 Тогда
		
		СписокОтбора = Новый СписокЗначений;
		Для Каждого Показатель Из ДоступныеПоказатели Цикл
			СписокОтбора.Добавить(Показатель);
		КонецЦикла;
		
		ОтборСтруктура = Новый Структура;
		ОтборСтруктура.Вставить("Ссылка", СписокОтбора);
		
		ФиксированныйОтбор = Новый ФиксированнаяСтруктура(ОтборСтруктура);
		ПараметрыФормы.Вставить("ФиксированныйОтбор", ФиксированныйОтбор);
		
		ПараметрыФормы.Вставить("Отбор", ОтборСтруктура);
		
	КонецЕсли;
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПроверкуНормативовПоказателя(ТекущиеДанные)
	
	НормативныеПоказателиМассив = НормативныеПоказатели.ВыгрузитьЗначения();
	Если НормативныеПоказателиМассив.Найти(ТекущиеДанные.Показатель) = Неопределено Тогда
		
		ТекстВопроса = "Не введен норматив на композиты. Продолжить создание лабораторного анализа?";
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
		
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ПослеПодтвержденияДобавленияПоказателя", ЭтотОбъект, ДополнительныеПараметры),
			ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияДобавленияПоказателя(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		
		ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
		Индекс = Объект.Показатели.Индекс(ТекущиеДанные);
		Если Индекс <> Неопределено Тогда
			Объект.Показатели.Удалить(Индекс);
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти
